In [12]:
import pandas as pd
from sqlalchemy import create_engine

In [13]:
# import CSV into Dataframe

csv_file = "Resources/ardd_fatalities_jan2021_csv.csv"
fatalaties_df = pd.read_csv(csv_file)
fatalaties_df.head()

,Crash ID,State,Month,Year,Dayweek,Time,Crash Type,Bus Involvement,Heavy Rigid Truck Involvement,Articulated Truck Involvement,...,Age,National Remoteness Areas,SA4 Name 2016,National LGA Name 2017,National Road Type,Christmas Period,Easter Period,Age Group,Day of week,Time of day
0,20215023,WA,1,2021,Sunday,19:16,Multiple,No,No,No,...,52,NaN,NaN,NaN,NaN,Yes,No,40_to_64,Weekend,Night
1,20215024,WA,1,2021,Sunday,6:10,Multiple,No,No,No,...,61,NaN,NaN,NaN,NaN,No,No,40_to_64,Weekend,Day
2,20215004,WA,1,2021,Sunday,17:29,Multiple,No,No,No,...,61,NaN,NaN,NaN,NaN,No,No,40_to_64,Weekend,Day
3,20211007,NSW,1,2021,Sunday,8:49,Multiple,No,No,No,...,29,Major Cities of Australia,Sydney - Ryde,Parramatta,Arterial Road,No,No,26_to_39,Weekend,Day
4,20215018,WA,1,2021,Sunday,19:31,Single,No,No,No,...,46,NaN,NaN,NaN,NaN,No,No,40_to_64,Weekend,Night

In [14]:
# filter dataframe by state of WA

state = ['WA']

fatalaties_df = fatalaties_df.loc[fatalaties_df["State"].isin(state)]
fatalaties_df

,Crash ID,State,Month,Year,Dayweek,Time,Crash Type,Bus Involvement,Heavy Rigid Truck Involvement,Articulated Truck Involvement,...,Age,National Remoteness Areas,SA4 Name 2016,National LGA Name 2017,National Road Type,Christmas Period,Easter Period,Age Group,Day of week,Time of day
0,20215023,WA,1,2021,Sunday,19:16,Multiple,No,No,No,...,52,NaN,NaN,NaN,NaN,Yes,No,40_to_64,Weekend,Night
1,20215024,WA,1,2021,Sunday,6:10,Multiple,No,No,No,...,61,NaN,NaN,NaN,NaN,No,No,40_to_64,Weekend,Day
2,20215004,WA,1,2021,Sunday,17:29,Multiple,No,No,No,...,61,NaN,NaN,NaN,NaN,No,No,40_to_64,Weekend,Day
4,20215018,WA,1,2021,Sunday,19:31,Single,No,No,No,...,46,NaN,NaN,NaN,NaN,No,No,40_to_64,Weekend,Night
5,20215001,WA,1,2021,Sunday,15:05,Single,No,No,No,...,17,NaN,NaN,NaN,NaN,No,No,17_to_25,Weekend,Day
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
52102,19895207,WA,1,1989,Tuesday,0:30,Single,No,-9,No,...,46,NaN,NaN,NaN,NaN,No,No,40_to_64,Weekday,Night
52103,19895133,WA,1,1989,Wednesday,21:00,Multiple,No,-9,No,...,70,NaN,NaN,NaN,NaN,No,No,65_to_74,Weekday,Night
52108,19895088,WA,1,1989,Monday,6:00,Single,No,-9,No,...,19,NaN,NaN,NaN,NaN,Yes,No,17_to_25,Weekday,Day
52109,19895088,WA,1,1989,Monday,6:00,Single,No,-9,No,...,17,NaN,NaN,NaN,NaN,Yes,No,17_to_25,Weekday,Day
52110,19895088,WA,1,1989,Monday,6:00,Single,No,-9,No,...,17,NaN,NaN,NaN,NaN,Yes,No,17_to_25,Weekday,Day

In [15]:
# filter dataframe to specific columns

new_fatalaties_df = fatalaties_df[['Crash ID', 'Road User', 'Age Group']].copy()
new_fatalaties_df.head()

   Crash ID         Road User Age Group
0  20215023     Pedal cyclist  40_to_64
1  20215024            Driver  40_to_64
2  20215004  Motorcycle rider  40_to_64
4  20215018  Motorcycle rider  40_to_64
5  20215001         Passenger  17_to_25

In [16]:
# Rename the column headers
new_fatalaties_df = new_fatalaties_df.rename(columns={"Crash ID": "crash_id",
                                                          "Road User": "road_user",
                                                          "Age Group": "age_group"})

# Set index
# new_fatalaties_df.set_index("id", inplace=True)

new_fatalaties_df.head()

   crash_id         road_user age_group
0  20215023     Pedal cyclist  40_to_64
1  20215024            Driver  40_to_64
2  20215004  Motorcycle rider  40_to_64
4  20215018  Motorcycle rider  40_to_64
5  20215001         Passenger  17_to_25

In [17]:
# replace for other/-9 and -9 values

new_fatalaties_df['road_user'] = new_fatalaties_df['road_user'].replace(['Other/-9'],'Other')

new_fatalaties_df['age_group'] = new_fatalaties_df['age_group'].replace(['-9'],'Other')

In [18]:
# connect to database

connection_string = "postgres:6186@localhost:5432/Road_Fatalaties"
engine = create_engine(f'postgresql://{connection_string}')

In [19]:
# confirm tables

engine.table_names()

['fatalaties', 'crashes']

In [24]:
# use pandas to load dataframe to database

new_fatalaties_df.to_sql(name='fatalaties', con=engine, if_exists='append', index=False)

In [25]:
pd.read_sql_query('select * from fatalaties', con=engine).head()

   id  crash_id         road_user age_group
0   1  20215023     Pedal cyclist  40_to_64
1   2  20215024            Driver  40_to_64
2   3  20215004  Motorcycle rider  40_to_64
3   4  20215018  Motorcycle rider  40_to_64
4   5  20215001         Passenger  17_to_25